In [4]:
import numpy as np
import pandas as pd

In [5]:
np.random.seed(101)

In [46]:
df = pd.DataFrame(np.random.randn(5,4), 'A B C D E'.split(), 'W X Y Z'.split())
df['name'] = ['John','Joseph','A01','B02','C03']
df

          W         X         Y         Z    name
A  0.302665  1.693723 -1.706086 -1.159119    John
B -0.134841  0.390528  0.166905  0.184502  Joseph
C  0.807706  0.072960  0.638787  0.329646     A01
D -0.497104 -0.754070 -0.943406  0.484752     B02
E -0.116773  1.901755  0.238127  1.996652     C03

# Conditional Selection

In [7]:
bol = df > 0

In [8]:
bol

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [9]:
df[bol]
#pass in the whole dataframe of booleans, gets NAN

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [12]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

# and, or Condition

<pre>
and: &
or: |
</pre>

In [14]:
df[(df['X']<1) & (df['Z'] > 0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [15]:
df[((0<df['X']) & (df['X']<1)) | (df['Y']>2)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

# Apply Selection

In [22]:
condiction = df['W'].apply(lambda x: x>0)
df[condiction]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df.loc[lambda x: (x.W>0) & (x.Y>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df[lambda x: (x.W>0) & (x.Y>0) & (x.name.str.contains('A'))]

          W        X         Y         Z name
C  0.807706  0.07296  0.638787  0.329646  A01

# Query

In [54]:
df.query('(W>0) & name.str.contains("A") ')

          W        X         Y         Z name
C  0.807706  0.07296  0.638787  0.329646  A01